In [5]:
import pandas as pd
import numpy as np

Series in Pandas

In [6]:
s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

SERIES FROM DICTIONARY

In [7]:
data = {
    "a": 10,
    "b": 20,
    "c": 30
}

s = pd.Series(data)

print(s)

a    10
b    20
c    30
dtype: int64

DataFrames in Pandas

In [8]:
data = {
    "Name": ["Aman", "krish", "karan"],
    "Age": [22, 23, 21],
    "Marks": [85, 90, 88]
}

In [9]:
print(data)

{'Name': ['Aman', 'krish', 'karan'], 'Age': [22, 23, 21], 'Marks': [85, 90, 88]}

In [10]:
type(data)

dict

In [11]:
marks = pd.DataFrame(data)

In [12]:
print(marks)

    Name  Age  Marks
0   Aman   22     85
1  krish   23     90
2  karan   21     88

In [14]:
marks = pd.DataFrame(
    data, 
    index =["Student1", "Student2", "Student3"],
)

In [15]:
print(marks)

           Name  Age  Marks
Student1   Aman   22     85
Student2  krish   23     90
Student3  karan   21     88

In [17]:
marks.set_index("Name", inplace=True) # if we are setting iplace = true it means we are changing the original object itself.

In [18]:
print(marks)

       Age  Marks
Name
Aman    22     85
krish   23     90
karan   21     88

In [41]:


df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah", "Ian", "Jack"],
    "Age": [12, 23, 4, 19, 21, 18, 25, 17, 20, 22],
    "Marks": [43, 90, 41, 92, 47, 38, 45, 89, 42, 40]
})


print(df)

      Name  Age  Marks
0    Alice   12     43
1      Bob   23     90
2  Charlie    4     41
3    David   19     92
4      Eva   21     47
5    Frank   18     38
6    Grace   25     45
7   Hannah   17     89
8      Ian   20     42
9     Jack   22     40

In [42]:
df.head() # as the no of rows is less than 5 so the output of both df head and df tail will be identical

      Name  Age  Marks
0    Alice   12     43
1      Bob   23     90
2  Charlie    4     41
3    David   19     92
4      Eva   21     47

In [43]:
df.tail() # as the no of rows is less than 5 so the output of both df head and df tail will be identical

     Name  Age  Marks
5   Frank   18     38
6   Grace   25     45
7  Hannah   17     89
8     Ian   20     42
9    Jack   22     40

In [44]:
df.describe()

             Age      Marks
count  10.000000  10.000000
mean   18.100000  56.700000
std     6.118279  23.352611
min     4.000000  38.000000
25%    17.250000  41.250000
50%    19.500000  44.000000
75%    21.750000  78.500000
max    25.000000  92.000000

Selecting the data

In [45]:
df["Name"]

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
5      Frank
6      Grace
7     Hannah
8        Ian
9       Jack
Name: Name, dtype: object

Filtering in Pandas

In [46]:
df[df["Marks"] > 85]

     Name  Age  Marks
1     Bob   23     90
3   David   19     92
7  Hannah   17     89

In [47]:
#multiple conditions

df[(df["Age"]>21)&(df["Marks"]>85)]

  Name  Age  Marks
1  Bob   23     90

In [48]:
df.sort_values("Marks")

      Name  Age  Marks
5    Frank   18     38
9     Jack   22     40
2  Charlie    4     41
8      Ian   20     42
0    Alice   12     43
6    Grace   25     45
4      Eva   21     47
7   Hannah   17     89
1      Bob   23     90
3    David   19     92

In [49]:
df.sort_values("Marks", ascending=False)

      Name  Age  Marks
3    David   19     92
1      Bob   23     90
7   Hannah   17     89
4      Eva   21     47
6    Grace   25     45
0    Alice   12     43
8      Ian   20     42
2  Charlie    4     41
9     Jack   22     40
5    Frank   18     38

In [51]:
df["Age"].value_counts()

Age
12    1
23    1
4     1
19    1
21    1
18    1
25    1
17    1
20    1
22    1
Name: count, dtype: int64

In [3]:
import pandas as pd